#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
aws_api_gateway_rest_api.visitors_rest_api: Refreshing state... [id=wvmekkxrt8]
aws_iam_role.lambda_cust_role: Refreshing state... [id=lambda_cust_role]
aws_dynamodb_table.visitors_app_table: Refreshing state... [id=Visitors]
aws_iam_role_policy.lambda_cust_policy: Refreshing state... [id=lambda_cust_role:lambda_cust_policy]
aws_api_gateway_resource.visitors_app_proxy: Refreshing state... [id=73931p]
aws_api_gateway_method.visitors_gateway_proxy: Refreshing state... [id=agm-wvmekkxrt8-73931p-ANY]
aws_lambda_function.visitorsapp: Refreshing state... [id=visitorsapp]
aws_lambda_permission.visitors_apigw: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.visitors_app_lambda: Refreshing state... [id=agi-wvmekkxrt8-73931p-ANY]
aws_api_gateway_deployment.visitors_app_api_gateway_deploy: Refreshing state... [id=cmfjnt]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_lambda_function.visitorsapp will be updated in-place
  ~ resource "aws_lambda_function" "visitorsapp" {
      - filename                       = "src/lambda_function_payload.zip" -> null
        id                             = "visitorsapp"
      ~ layers                         = [
          - "arn:aws:lambda:us-east-1:327910803467:layer:visitors_app_layer:20",
        ] -> (known after apply)
      + s3_bucket                      = "garrettleber-tf-backend"
      + s3_key                         = "prod/lambda-zips/lambda_function_payload.zip.base64sha256"
        tags                           = {}
        # (15 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.visitors_app_layer will be created
  + resource "aws_lambda_layer_version" "visitors_app_layer" {
      + arn                 = (known after apply)
      + compatible_runtimes = [
          + "python3.8",
        ]
      + created_date        = (known after apply)
      + id                  = (known after apply)
      + layer_arn           = (known after apply)
      + layer_name          = "visitors_app_layer"
      + s3_bucket           = "garrettleber-tf-backend"
      + s3_key              = "prod/lambda-zips/lambda_layer_payload.zip.base64sha256"
      + source_code_hash    = "TCDn7yt4tAoT+ZjQt9VM9mZCjPL8YTrwq4OJowJPp/Q="
      + source_code_size    = (known after apply)
      + version             = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```
</details>
*Pusher: @lebergarrett, Action: `pull_request`*